In [2]:
import pandas as pd

In [10]:
categories = pd.read_csv("categories.csv")
customers = pd.read_csv("customers.csv", encoding='latin1')
employees = pd.read_csv("employees.csv")
order_details = pd.read_csv("order_details.csv")
orders = pd.read_csv("orders.csv")
products = pd.read_csv("products.csv", encoding='latin1')
shippers = pd.read_csv("shippers.csv")

In [12]:
categories.head()

,categoryID,categoryName,description
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
2,3,Confections,"Desserts, candies, and sweet breads"
3,4,Dairy Products,Cheeses
4,5,Grains & Cereals,"Breads, crackers, pasta, and cereal"

In [24]:
categories.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   categoryID    8 non-null      int64
 1   categoryName  8 non-null      object
 2   description   8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [7]:
customers.head()

,customerID,companyName,contactName,contactTitle,city,country
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Berlin,Germany
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Mexico City,Mexico
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mexico City,Mexico
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,London,UK
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Luleå,Sweden

In [21]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91 entries, 0 to 90
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customerID    91 non-null     object
 1   companyName   91 non-null     object
 2   contactName   91 non-null     object
 3   contactTitle  91 non-null     object
 4   city          91 non-null     object
 5   country       91 non-null     object
dtypes: object(6)
memory usage: 4.4+ KB

In [13]:
employees.head()

,employeeID,employeeName,title,city,country,reportsTo
0,1,Nancy Davolio,Sales Representative,New York,USA,8.0
1,2,Andrew Fuller,Vice President Sales,New York,USA,NaN
2,3,Janet Leverling,Sales Representative,New York,USA,8.0
3,4,Margaret Peacock,Sales Representative,New York,USA,8.0
4,5,Steven Buchanan,Sales Manager,London,UK,2.0

In [25]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   employeeID    9 non-null      int64
 1   employeeName  9 non-null      object
 2   title         9 non-null      object
 3   city          9 non-null      object
 4   country       9 non-null      object
 5   reportsTo     8 non-null      float64
dtypes: float64(1), int64(1), object(4)
memory usage: 560.0+ bytes

In [16]:
order_details.head()

   orderID  productID  unitPrice  quantity  discount
0    10248         11       14.0        12       0.0
1    10248         42        9.8        10       0.0
2    10248         72       34.8         5       0.0
3    10249         14       18.6         9       0.0
4    10249         51       42.4        40       0.0

In [26]:
order_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2155 entries, 0 to 2154
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   orderID    2155 non-null   int64
 1   productID  2155 non-null   int64
 2   unitPrice  2155 non-null   float64
 3   quantity   2155 non-null   int64
 4   discount   2155 non-null   float64
dtypes: float64(2), int64(3)
memory usage: 84.3 KB

In [29]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   orderID       830 non-null    int64
 1   customerID    830 non-null    object
 2   employeeID    830 non-null    int64
 3   orderDate     830 non-null    object
 4   requiredDate  830 non-null    object
 5   shippedDate   809 non-null    object
 6   shipperID     830 non-null    int64
 7   freight       830 non-null    float64
dtypes: float64(1), int64(3), object(4)
memory usage: 52.0+ KB

In [14]:
products.head()

,productID,productName,quantityPerUnit,unitPrice,discontinued,categoryID
0,1,Chai,10 boxes x 20 bags,18.00,0,1
1,2,Chang,24 - 12 oz bottles,19.00,0,1
2,3,Aniseed Syrup,12 - 550 ml bottles,10.00,0,2
3,4,Chef Anton's Cajun Seasoning,48 - 6 oz jars,22.00,0,2
4,5,Chef Anton's Gumbo Mix,36 boxes,21.35,1,2

In [28]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   productID        77 non-null     int64
 1   productName      77 non-null     object
 2   quantityPerUnit  77 non-null     object
 3   unitPrice        77 non-null     float64
 4   discontinued     77 non-null     int64
 5   categoryID       77 non-null     int64
dtypes: float64(1), int64(3), object(2)
memory usage: 3.7+ KB

In [15]:
shippers.head()

   shipperID       companyName
0          1    Speedy Express
1          2    United Package
2          3  Federal Shipping

In [20]:
shippers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   shipperID    3 non-null      int64
 1   companyName  3 non-null      object
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes